<template>
 <div class="Product">

   <img @click="$router.push(`/`)"  class="Product__logo" src="~assets/statics/proplan-logo.png" alt="logo">

   Product
   {{ $route.params.id }}
<div class="Product__wrapper flex flex-center">
   <q-card class="my-card" >
            <q-img  src="~assets/statics/img/dogs/1.jpg" style="width: 400px">
                <div class="absolute-bottom">
                <div class="text-h5">Pro Plan для взрослых собак мелких пород с чувствительной кожей с лососем</div>
                <div class="text-subtitle2"></div>
                </div>
            </q-img>

            <q-card-actions class=" flex flex-center">
                <q-btn flat color="blue" @click="more = true" >Подробнее</q-btn>
            </q-card-actions>
        </q-card>

        <q-dialog v-model="more">
      <q-card>
        <q-card-section class="row items-center">
            <q-btn icon="close" flat round dense v-close-popup />
          <div class="text-h5">Pro Plan для взрослых собак мелких пород с чувствительной кожей с лососем</div>
          <q-space />

        </q-card-section>

        <q-card-section>
          <p class="text-h6">Разработанный нашими ветеринарами и диетологами корм Purina PRO PLAN с комплексом OPTIDERMA обеспечивает улучшенное питание, которое поддерживает чувствительную кожу взрослых собак. Подтверждено, что OPTIDERMA включает в себя специальную комбинацию питательных веществ, которые поддерживают здоровье кожи и красивую шерсть, а отобранные источники белка помогают сократить возможные кожные реакции, связанные с пищевой чувствительностью.<br>
          Специально отобранные источники белка для собак с чувствительной кожей. Сочетание основных питательных веществ, которое помогает поддерживать здоровье суставов вашей собаки при активном образе жизни. Клинически подтверждено: поддерживает здоровье кожи. Содержит высококачественный белок из лосося.</p>
        </q-card-section>
      </q-card>
    </q-dialog>
</div>

 </div>
</template>

<script>

export default {
  name: 'Product',
  data () {
    return {
   more: false,
   products:[{
     id:"0startd1длясобакd2даd3Мелкаяиликарликоваяl1да",
     image:['dogs/1.jpg'],
     textFront:["Pro Plan для взрослых собак мелких пород с чувствительной кожей с лососем"],
     textExpan:["Разработанный нашими ветеринарами и диетологами корм Purina PRO PLAN с комплексом OPTIDERMA обеспечивает улучшенное питание, которое поддерживает чувствительную кожу взрослых собак. Подтверждено, что OPTIDERMA включает в себя специальную комбинацию питательных веществ, которые поддерживают здоровье кожи и красивую шерсть, а отобранные источники белка помогают сократить возможные кожные реакции, связанные с пищевой чувствительностью. Специально отобранные источники белка для собак с чувствительной кожей. Сочетание основных питательных веществ, которое помогает поддерживать здоровье суставов вашей собаки при активном образе жизни. Клинически подтверждено: поддерживает здоровье кожи. Содержит высококачественный белок из лосося."],
   },
   {
     id:"0startd1длясобакd2даd3Мелкаяиликарликоваяd4нетl2да",
     image:['dogs/2.jpg', 'dogs/3.jpg'],
     textFront:["Pro Plan для взрослых собак мелких пород с чувствительным пищеварением с ягненком", "Pro Plan для взрослых собак мелких и карликовых пород с чувствительным пищеварением беззерновой с индейкой"],
     textExpan:[" Разработанный нашими ветеринарами и диетологами корм Purina PRO PLAN® с комплексом OPTIDIGEST® повышает здоровье пищеварительной системы собак, испытывающих дискомфорт в желудочно-кишечном тракте. Клинически доказано: OPTIDIGEST® содержит отобранный источник пребиотиков для улучшения баланса микрофлоры кишечника и качества стула. Корм легко переваривается, благодаря чему подходит для собак с чувствительным пищеварением. Пребиотик активно способствует здоровью кишечника. Клинически подтверждено: улучшает баланс микрофлоры кишечника. Собственная технология приготовления позволяет сохранить полезные свойства куриного мяса. Содержит высококачественный белок из ягненка.", "Корм PRO PLAN® OPTIDIGEST® Grain Free Formula разработан специально для собак мелких и карликовых пород с чувствительным пищеварением. Это беззерновой легкоперевариваемый рацион, который содержит все необходимые ингредиенты для правильного пищеварения. В его основе - комплекс OPTIDIGEST® - особое сочетание питательных веществ, которое помогает поддерживать баланс микрофлоры. Он содержит специальные ингредиенты для поддержания здоровья кишечника и хорошего качества стула. Способствует росту бифидобактерий для улучшения баланса микрофлоры кишечника благодаря содержанию пребиотиков. OPTIDIGEST® GRAIN FREE Formula с высоким содержанием индейки. Чтобы вы смогли подобрать корм, который подходит именно вашему питомцу с чувствительным пищеварением."],
   },
   {
     id:"0startd1длясобакd2даd3Мелкаяиликарликоваяd4нетl3нет",
     image:['dogs/4.jpg'],
     textFront:["Pro Plan для взрослых собак мелких пород с курицей"],
     textExpan:["OPTIBALANCE® способствует поддержанию здоровья сердца. Особое сочетание компонентов для здоровья зубов и десен. Сочетание основных питательных веществ, которое помогает поддерживать здоровье суставов вашей собаки при активном образе жизни. Природный источник волокон улучшает здоровье кишечника. Содержит кусочки высококачественного куриного мяса."],
   },
   {
     id:"0startd1длясобакd2даd3крупнаяl1да",
     image:['dogs/5.jpg'],
     textFront:["Pro Plan для взрослых собак средних и крупных пород с чувствительным пищеварением беззерновой с индейкой"],
     textExpan:["Корм PRO PLAN® OPTIDIGEST® Grain Free Formula разработан специально для собак средних и крупных пород с чувствительным пищеварением. Это беззерновой легкоперевариваемый рацион, который содержит все необходимые ингредиенты для правильного пищеварения. В его основе - комплекс OPTIDIGEST®. br Способствует росту бифидобактерий для улучшения баланса микрофлоры кишечника благодаря содержанию пребиотиков. br OPTIDIGEST® - особое сочетание питательных веществ, которое помогает поддерживать баланс микрофлоры. Он содержит специальные ингредиенты для поддержания здоровья кишечника и хорошего качества стула. Теперь в линейке PRO PLAN® для собак есть беззерновые рационы OPTIDIGEST® GRAIN FREE Formula с высоким содержанием индейки. Чтобы вы смогли подобрать корм, который подходит именно вашему питомцу с чувствительным пищеварением."],
   },{
     id:"0startd1длясобакd2даd3крупнаяd4нетl2да",
      image:['dogs/6.jpg'],
     textFront:["Pro Plan для взрослых собак крупных пород атлетического телосложения с курицей"],
     textExpan:["Сухой корм для взрослых собак PRO PLAN® OPTIBALANCE® создан специально для больших атлетичных животных, учитывает их особые потребности, помогает сохранять их силу и активность. br В состав корма входит комплекс OPTIBALANCE®, который содержит в себе специально отобранные питательные вещества, поддерживающие особые потребности собак и положительно влияющие на здоровье питомцев в долгосрочной перспективе. Собачий корм с курицей PRO PLAN® Large Adult Athletic является полнорационным и содержит большое количество белка в составе."],
   },
   {
     id:"0startd1длясобакd2даd3средняяl1да",
      image:['dogs/7.jpg'],
     textFront:["Pro Plan для взрослых собак средних пород с чувствительной кожей с лососем"],
     textExpan:["Разработанный нашими ветеринарами и диетологами корм Purina PRO PLAN® с комплексом OPTIDERMA® обеспечивает самое современное питание, которое поддерживает чувствительную кожу взрослых собак. Подтверждено, что OPTIDERMA® включает в себя специальную комбинацию питательных веществ, которые поддерживают здоровье кожи и красивую шерсть, а отобранные источники белка помогают сократить возможные кожные реакции, связанные с пищевой чувствительностью. Содержит высококачественный белок из лосося."],
   },
    {
     id:"0startd1длясобакd2даd3средняяl1да",
      image:['dogs/8.jpg'],
     textFront:["Pro Plan для взрослых собак средних пород с чувствительной кожей с лососем"],
     textExpan:["Разработанный нашими ветеринарами и диетологами корм Purina PRO PLAN® с комплексом OPTIDERMA® обеспечивает самое современное питание, которое поддерживает чувствительную кожу взрослых собак. Подтверждено, что OPTIDERMA® включает в себя специальную комбинацию питательных веществ, которые поддерживают здоровье кожи и красивую шерсть, а отобранные источники белка помогают сократить возможные кожные реакции, связанные с пищевой чувствительностью. Содержит высококачественный белок из лосося."],
   },
    {
     id:"0startd1длясобакd2даd3средняяl1да",
      image:['dogs/9.jpg', 'dogs/10.jpg'],
     textFront:["Pro Plan для взрослых собак средних пород с чувствительным пищеварением с ягненком", "Pro Plan для взрослых собак средних и крупных пород с чувствительным пищеварением  беззерновой с индейкой"],
     textExpan:["Разработанный нашими ветеринарами и диетологами корм Purina PRO PLAN® с комплексом OPTIDIGEST® повышает здоровье пищеварительной системы собак, испытывающих дискомфорт в желудочно-кишечном тракте. Клинически доказано: OPTIDIGEST® содержит отобранный источник пребиотиков для улучшения баланса микрофлоры кишечника и качества стула. Содержит высококачественный белок из ягненка.", "Корм PRO PLAN® OPTIDIGEST® Grain Free Formula разработан специально для собак средних и крупных пород с чувствительным пищеварением. Это беззерновой легкоперевариваемый рацион, который содержит все необходимые ингредиенты для правильного пищеварения. В его основе - комплекс OPTIDIGEST®. br Способствует росту бифидобактерий для улучшения баланса микрофлоры кишечника благодаря содержанию пребиотиков. br OPTIDIGEST® - особое сочетание питательных веществ, которое помогает поддерживать баланс микрофлоры. Он содержит специальные ингредиенты для поддержания здоровья кишечника и хорошего качества стула. Теперь в линейке PRO PLAN® для собак есть беззерновые рационы OPTIDIGEST® GRAIN FREE Formula с высоким содержанием индейки. Чтобы вы смогли подобрать корм, который подходит именно вашему питомцу с чувствительным пищеварением."],
   },
    {
     id:"0startd1длясобакd2даd3средняяd4нетl3нет",
      image:['dogs/11.jpg', 'dogs/12.jpg'],
     textFront:["Pro Plan для взрослых активных собак всех пород с курицей", "Pro Plan для взрослых собак средних пород с курицей"],
     textExpan:["Корм Purina PRO PLAN® с комплексом OPTIPOWER® разработан для взрослых собак с особенно высоким уровнем физической активности. OPTIPOWER® сочетает в себе основные питательные вещества, которые повышают выносливость, способствуют быстрому восстановлению мышц и поддержанию здоровья суставов. Это стало возможным благодаря высокому содержанию в формуле белков, жиров и омега 3 жирных кислот. Содержит все питательные вещества, необходимые кормящей собаке для здоровья щенков. Содержит кусочки высококачественного куриного мяса.", "Разработанный нашими ветеринарами и диетологами корм Purina PRO PLAN® с комплексом OPTIHEALTH® предоставляет современное питание, которое оказывает долгосрочное влияние на здоровье собак. Комплекс OPTIHEALTH® сочетает специально отобранные питательные вещества необходимые собакам разных размеров и телосложения, который поддерживает их особые потребности и помогает сохранить им отличное состояние. Особое сочетание компонентов для здоровья зубов и десен. Сочетание основных питательных веществ, которое помогает поддерживать здоровье суставов вашей собаки при активном образе жизни. Помогает собаке сохранять блестящую шерсть. Содержит кусочки высококачественного куриного мяса."]},
     {
       id:"0startd1длясобакd2нетd3Мелкаяиликарликоваяl1да",
       image:['dogs/17.jpg'],
     textFront:["Pro Plan для щенков мелких пород с чувствительной кожей с лососем"],
     textExpan:["Разработанный нашими ветеринарами и диетологами корм Purina PRO PLAN® с комплексом OPTIDERMA® обеспечивает улучшенное питание, которое поддерживает чувствительную кожу щенков. Подтверждено, что комплекс OPTIDERMA® включает в себя специальную комбинацию питательных веществ, которые поддерживают здоровье кожи и красивую шерсть, а отобранные источники белка помогают сократить возможные кожные реакции, связанные с пищевой чувствительностью. Содержит высококачественный белок из лосося."],
     },
      {
       id:"0startd1длясобакd5нетd6Мелкаяиликарликоваяl10нет",
       image:['dogs/18.jpg'],
     textFront:["Pro Plan для щенков мелких пород с курицей"],
     textExpan:["Чтобы помочь укрепить естественную защиту щенков в начале жизни, ветеринары и диетологи Purina разработали корм Purina PRO PLAN® PUPPY с комплексом OPTISTART®. Особый ингредиент молозиво — первичное молоко матери, входящий в комплекс OPTISTART®, богатый природными антителами, помогает укрепить естественную защиту щенков для борьбы с ежедневными проблемами. br Помогает развивающейся иммунной системе щенка действовать эффективно. Особое сочетание компонентов для здоровья зубов и десен. Сочетание основных питательных веществ, которое помогает поддерживать здоровье суставов вашего щенка при активном образе жизни. В состав корма входит специальный компонент для укрепления иммунитета и здоровья на долгие годы. Подобранная энергетическая ценность корма для щенков с повышенным метаболизмом. Содержит кусочки высококачественного куриного мяса."],
     },
      {
       id:"0startd1длясобакd5нетl8крупная",
       image:['dogs/13.jpg'],
     textFront:["Pro Plan для щенков крупных пород атлетического телосложения с курицей"],
     textExpan:["Чтобы помочь укрепить естественную защиту щенков в начале жизни, ветеринары и диетологи Purina разработали корм Purina PRO PLAN® PUPPY с комплексом OPTISTART®. Особый ингредиент молозиво — первичное молоко матери, входящий в комплекс OPTISTART®, богатый природными антителами, помогает укрепить естественную защиту щенков для борьбы с ежедневными проблемами. br Помогает развивающейся иммунной системе щенка действовать эффективно. Особое сочетание компонентов для здоровья зубов и десен. Сочетание основных питательных веществ, которое помогает поддерживать здоровье суставов вашего щенка при активном образе жизни. В состав корма входит специальный компонент для укрепления иммунитета и здоровья на долгие годы. Подобранная энергетическая ценность корма для щенков с повышенным метаболизмом. Содержит кусочки высококачественного куриного мяса."],
     },
        {
       id:"0startd1длясобакd5нетd3средняяl1да",
       image:['dogs/14.jpg'],
     textFront:["Pro Plan для щенков средних пород с чувствительной кожей с лососем"],
     textExpan:["Разработанный нашими ветеринарами и диетологами корм Purina PRO PLAN® с комплексом OPTIDERMA® обеспечивает улучшенное питание, которое поддерживает чувствительную кожу щенков. Подтверждено, что комплекс OPTIDERMA® включает в себя специальную комбинацию питательных веществ, которые поддерживают здоровье кожи и красивую шерсть, а отобранные источники белка помогают сократить возможные кожные реакции, связанные с пищевой чувствительностью. Содержит высококачественный белок из лосося."],
     },
       {
       id:"0startd1длясобакd5нетd3средняяd4нетl2да",
       image:['dogs/16.jpg'],
     textFront:["Pro Plan для щенков средних пород с чувствительным пищеварением с ягненком"],
     textExpan:["Разработанный нашими ветеринарами и диетологами корм Purina PRO PLAN® с комплексом OPTIDIGEST® повышает здоровье пищеварительной системы щенков, испытывающих дискомфорт в желудочно-кишечном тракте. Клинически доказано: OPTIDIGEST® содержит отобранный источник пребиотиков для улучшения баланса микрофлоры кишечника и качества стула. В состав корма входит специальный компонент для укрепления иммунитета и здоровья на долгие годы."],
     },
      {
       id:"0startd1длясобакd5нетd3средняяd4нетl2нет",
       image:['dogs/15.jpg'],
     textFront:["Pro Plan для щенков средних пород с курицей"],
     textExpan:["Чтобы помочь укрепить естественную защиту щенков в начале жизни, ветеринары и диетологи Purina разработали корм Purina PRO PLAN® PUPPY с комплексом OPTISTART®. Особый ингредиент молозиво — первичное молоко матери, входящий в комплекс OPTISTART®, богатый природными антителами, помогает укрепить естественную защиту щенков для борьбы с ежедневными проблемами. br Помогает развивающейся иммунной системе щенка действовать эффективно. Особое сочетание компонентов для здоровья зубов и десен. Сочетание основных питательных веществ, которое помогает поддерживать здоровье суставов вашего щенка при активном образе жизни. В состав корма входит специальный компонент для укрепления иммунитета и здоровья на долгие годы. Подобранная энергетическая ценность корма для щенков с повышенным метаболизмом. Содержит кусочки высококачественного куриного мяса."],
     },
       {
       id:"0startc1длякошекc2даc3даlда",
       image:['cats/10.jpg'],
     textFront:["Pro Plan для стерилизованных кошек старше 7 лет с индейкой"],
     textExpan:["PRO PLAN® Sterilised 7+ сочетает вс е основные питательные вещества, включая витамины A, C и E, бета-каротин, жирные кислоты омега-3 и омега-6, натуральный пребиотик. Рецептура богата белками, имеет пониженный уровень жира, оптимальную калорийность. PRO PLAN® Sterilised 7+ разработан с использованием методик RSS и APR, которые позволяют гарантировать сбалансированный уровень pH мочи, что является профилактикой мочекаменной болезни. br Благодаря включению в состав комплекса LONGEVIS®, являющегося запатентованным компанией Nestlé PURINA® сочетанием ингредиентов, срок жизни кошек 7+ продлевается в среднем на один год, что научно подтверждено. Показатели мочи ОПН и КПА поддерживаются на недонасыщенном или низком метастабильном уровне для струвита и оксалата кальция Имеет высокое содержание белков (41%), низкое содержание углеводов, а также содержит клетчатку. Руководство по кормлению составлено с учетом низких энергетических потребностей, стерилизованных/кастрированных кошек/котов. Благодаря включению в состав комплекса LONGEVIS®, ключевые параметры здоровья взрослых кошек 7+ улучшаются, что научно подтверждено."],
     },
      {
       id:"0startc1длякошекc2даc3даlнет",
       image:['cats/11.jpg'],
     textFront:["Pro Plan для кошек старше 7 лет с лососем"],
     textExpan:["PRO PLAN® Adult 7+ сочетает все основные питательные вещества, включая витамины A, C и E и бета-каротин, а также жирные кислоты омега-3 и омега-6, и натуральный пребиотик в уникальной рецептуре для кошек старше 7 лет. Подходит для стерилизованных кошек. br Благодаря включению в состав комплекса LONGEVIS®, являющегося запатентованным компанией Nestlé PURINA® сочетанием ингредиентов, срок жизни кошек 7+ продлевается в среднем на один год, что научно подтверждено. Благодаря включению в состав комплекса LONGEVIS®, ключевые параметры здоровья взрослых кошек 7+ улучшаются, что научно подтверждено. Включение в состав комплекса LONGEVIS® способствует здоровью кишечной микрофлоры, что научно подтверждено. Содержит основные минералы и обеспечивает регуляцию рН мочи."],
     },
      {
       id:"0startc1длякошекc2даc4нетc5даlда",
       image:['cats/1.jpg'],
     textFront:["Pro Plan для стерилизованных кошек с курицей"],
     textExpan:["PRO PLAN® Sterilised сочетает все основные питательные вещества, включая витамины A, C и E и жирные кислоты омега-3 и омега-6, в богатой белками, нежирной рецептуре, которая также помогает обеспечить сбалансированный уровень pH мочи. br Содержит формулу OPTIDIGEST®, способствующую поддержанию здоровья пищеварительной системе благодаря пребиотикам. Поддерживает здоровье мочевыделительной системы у кастрированных кошек, подверженных повышенному риску развития мочекаменной болезни. Помогает поддерживать идеальный вес тела благодаря точному балансу белков, жиров и углеводов. Высокое содержание белка и низкое содержание жира."],
     },
      {
       id:"0startc1длякошекc2даc4нетc5даlнет",
       image:['cats/2.jpg', 'cats/3.jpg', 'cats/4.jpg'],
     textFront:["Pro Plan для стерилизованных кошек с кроликом или лососем, или индейкой", "Pro Plan для стерилизованных кошек с кроликом или лососем, или индейкой", "Pro Plan для стерилизованных кошек с кроликом или лососем, или индейкой"],
     textExpan:["PRO PLAN® Sterilised сочетает все основные питательные вещества, включая витамины A, C и E и жирные кислоты омега-3 и омега-6, в богатой белками, нежирной рецептуре, которая также помогает обеспечить сбалансированный уровень pH мочи. br  Содержит OPTIRENAL® — специальное сочетание питательных веществ, включая антиоксиданты, аргинин и омега-3 жирные кислоты. Показатели мочи ОПН и КПА поддерживаются на недонасыщенном или низком метастабильном уровне для струвита и оксалата кальция. Имеет высокое содержание белков (41%), низкое содержание углеводов, а также содержит клетчатку. Руководство по кормлению составлено с учетом низких энергетических потребностей, стерилизованных/кастрированных кошек/котов. Хрустящие гранулы сокращают отложение зубного налета и зубного камня благодаря механическому воздействию.", "PRO PLAN® Sterilised сочетает все основные питательные вещества, включая витамины A, C и E и жирные кислоты омега-3 и омега-6, в богатой белками, нежирной рецептуре, которая также помогает обеспечить сбалансированный уровень pH мочи. br  Содержит OPTIRENAL® — специальное сочетание питательных веществ, включая антиоксиданты, аргинин и омега-3 жирные кислоты. Показатели мочи ОПН и КПА поддерживаются на недонасыщенном или низком метастабильном уровне для струвита и оксалата кальция. Имеет высокое содержание белков (41%), низкое содержание углеводов, а также содержит клетчатку. Руководство по кормлению составлено с учетом низких энергетических потребностей, стерилизованных/кастрированных кошек/котов. Хрустящие гранулы сокращают отложение зубного налета и зубного камня благодаря механическому воздействию.", "PRO PLAN® Sterilised сочетает все основные питательные вещества, включая витамины A, C и E и жирные кислоты омега-3 и омега-6, в богатой белками, нежирной рецептуре, которая также помогает обеспечить сбалансированный уровень pH мочи. br  Содержит OPTIRENAL® — специальное сочетание питательных веществ, включая антиоксиданты, аргинин и омега-3 жирные кислоты. Показатели мочи ОПН и КПА поддерживаются на недонасыщенном или низком метастабильном уровне для струвита и оксалата кальция. Имеет высокое содержание белков (41%), низкое содержание углеводов, а также содержит клетчатку. Руководство по кормлению составлено с учетом низких энергетических потребностей, стерилизованных/кастрированных кошек/котов. Хрустящие гранулы сокращают отложение зубного налета и зубного камня благодаря механическому воздействию."],
     },
        {
       id:"0startc1длякошекc2даc4нетc6нетlда",
       image:['cats/5.jpg', 'cats/6.jpg'],
     textFront:["Pro Plan для кошек с чувствительным пищеварением с ягненком", "Pro Plan для кошек с чувствительным пищеварением с индейкой"],
     textExpan:["Для взрослых кошек с чувствительной системой пищеварения или привередливых в еде. PRO PLAN® Delicate — сбалансированный корм для кошек, который сочетает все основные питательные вещества, включая витамины и минералы. br Содержит OPTIRENAL® — специальное сочетание питательных веществ, включая антиоксиданты, аргинин и омега-3 жирные кислоты. Имеет высокое содержание белков (40%) и витаминов Е и С. Формула с ограниченным числом белков и высококачественными ингредиентами. Приготовлен из высококачественных ингредиентов со специальной приятной оболочкой гранул.", "Для взрослых кошек с чувствительной системой пищеварения или привередливых в еде. PRO PLAN® Delicate — сбалансированный корм для кошек, который сочетает все основные питательные вещества, включая витамины и минералы. br Содержит OPTIRENAL® — специальное сочетание питательных веществ, включая антиоксиданты, аргинин и омега-3 жирные кислоты. Имеет высокое содержание белков (40%) и витаминов Е и С. Формула с ограниченным числом белков и высококачественными ингредиентами. Приготовлен из высококачественных ингредиентов со специальной приятной оболочкой гранул."],
     },
      {
       id:"0startc1длякошекc2даc4нетc6нетc7нетlда",
       image:['cats/7.jpg'],
     textFront:["Pro Plan для кошек для поддержания красоты шерсти и здоровья кожи с лососем"],
     textExpan:["PRO PLAN® Derma Plus — сбалансированный корм для кошек, который сочетает все основные питательные вещества, включая витамины группы B, витамин E, цинк, жирные кислоты омега-3 и омега-6 и диетическую клетчатку. Специально для чувствительной кожи. br Имеет высокое содержание клетчатки, которая стимулирует перистальтику кишечника и, как было доказано, способствует выведению шерсти с фекальными массами. В состав входят кусочки лосося, а гранулы покрыты очень приятной оболочкой. Содержит запатентованный комплекс питательных веществ для здоровой кожи и красивой шерсти. Имеет высокое содержание белков (36%) — основного строительного материала шерсти, а также все другие питательные вещества для кожи, необходимые для роста красивой шерсти."],
     },
      {
       id:"0startc1длякошекc2даc4нетc6нетc7нетlнет",
       image:['cats/8.jpg', 'cats/9.jpg'],
     textFront:["Pro Plan для взрослых кошек с курицей", "Pro Plan для взрослых кошек с лососем"],
     textExpan:["PRO PLAN® Adult сочетает в себе все основные питательные вещества, включая витамины A, C и E, а также жирные кислоты омега-3 и омега-6, и натуральный пребиотик, и является высококачественным питательным кормом для кошек. br Содержит формулу OPTIRENAL® — специальное сочетание питательных веществ, включая антиоксиданты, аргинин и омега-3 жирные кислоты, которые поддерживают здоровье почек. Высокий уровень антиоксидантов и витаминов в составе, в частности витамины С и Е, поддерживают здоровье иммунной системы. Поддерживает здоровье и подвижность суставов благодаря высокому уровню белка, который питает мускулы кошки и помигает им оставаться подтянутыми. Защита зубов от образования зубного налета и камня благодаря хрустящей текстуре гранул и специальным минералам, препятствующим образованию зубного камня.", "PRO PLAN® Adult сочетает в себе все основные питательные вещества, включая витамины A, C и E, а также жирные кислоты омега-3 и омега-6, и натуральный пребиотик, и является высококачественным питательным кормом для кошек. br Содержит формулу OPTIRENAL® — специальное сочетание питательных веществ, включая антиоксиданты, аргинин и омега-3 жирные кислоты, которые поддерживают здоровье почек. Высокий уровень антиоксидантов и витаминов в составе, в частности витамины С и Е, поддерживают здоровье иммунной системы. Поддерживает здоровье и подвижность суставов благодаря высокому уровню белка, который питает мускулы кошки и помигает им оставаться подтянутыми. Защита зубов от образования зубного налета и камня благодаря хрустящей текстуре гранул и специальным минералам, препятствующим образованию зубного камня."],
     },
      {
       id:"0startc1длякошекc8нетlда",
       image:['cats/12.jpg'],
     textFront:["Pro Plan для котят с чувствительным пищеварением с индейкой"],
     textExpan:["PRO PLAN® для котят — корм с высоким содержанием белка, сочетающий все необходимые питательные вещества, включая витамины С и D3, а также Омега-3 жирную кислоту. Легко усвояемый корм для котят с чувствительным пищеварением. br   OPTIDIGEST® — здоровое пищеварение. Доказано, что формула OPTIDIGEST® укрепляет здоровье пищеварительной системы, благодаря пребиотикам. Помогает улучшать пищевую переносимость благодаря ограниченному количеству источников белка."],
     },
       {
       id:"0startc1длякошекc8нетlнет",
       image:['cats/13.jpg'],
     textFront:["Pro Plan для котят с курицей"],
     textExpan:["Котята, как маленькие дети, для развития и хорошего набора веса должны есть понемногу, но часто. При этом им необходимо намного больше протеинов (белка) и кальция, чем взрослому коту. Сухой корм Purina PRO PLAN® Junior разработан с учётом рекомендаций по кормлению и содержит высокое количество белков, необходимые минералы и микроэлементы для успешного развития котят. br Содержит OPTISTART® с коровьим молозивом, которое достоверно стабилизирует кишечную микрофлору во время стресса у котят, укрепляет иммунную систему котят на местном и системном уровне: усиливает производство в кишечнике секреторного иммуноглобулина А (IgA), а также повышает циркулирующие уровни вакцино-специфического иммуноглобулина G (IgG) после вакцинации. Содержит природный источник ДГК (докозогексаеновой кислоты), которая играет важнейшую роль в оптимальном развитии клеток сетчатки и нейронов. Высокое содержание белков (40%) для усиленного развития безжировой массы тела. Сбалансированный комплекс минералов для здорового роста костей."],
     },
   ]
    }
  },
  computed:{
    choosedProduct(){
      return this.products.find(el=>el.id===this.$route.params.id);
    }
  },
  methods:{

  }
}
</script>

<style>

.Product{
  background: #000;
  position: relative;
  height: 100vh;
}

.Product__logo{
  width: 20%;
  position: absolute;
  left: 0;
  right: 0;
  top: 0;
  bottom: 0;
  margin: auto;
  border: 1px solid black;
  outline: 1px solid #fff;
  cursor: pointer;
  position: absolute;
  top: 3vh;
  bottom: unset;
  border:none;
  box-shadow: 0px 6px 6px -5px #fff;
  width: 13.7%;
}
.Product__wrapper
{
    width: 402px;
    margin: auto;
    margin-top: 33vh;
    border: 2px solid #fff;
    border-radius: 8px;
}
span.q-btn__content
{
      font-size: 1.5rem;
}



</style>
