<template>
 <div class="Product">

   <img @click="$router.push(`/`)"  class="Product__logo" src="~assets/statics/proplan-logo.png" alt="logo">

   Product
   {{ $route.params.id }}
<div class="Product__wrapper flex flex-center">
   <q-card class="my-card" >
            <q-img  src="~assets/statics/img/dogs/1.jpg" style="width: 400px">
                <div class="absolute-bottom">
                <div class="text-h5">Pro Plan для взрослых собак мелких пород с чувствительной кожей с лососем</div>
                <div class="text-subtitle2"></div>
                </div>
            </q-img>

            <q-card-actions class=" flex flex-center">
                <q-btn flat color="blue" @click="more = true" >Подробнее</q-btn>
            </q-card-actions>
        </q-card>

        <q-dialog v-model="more">
      <q-card>
        <q-card-section class="row items-center">
            <q-btn icon="close" flat round dense v-close-popup />
          <div class="text-h5">Pro Plan для взрослых собак мелких пород с чувствительной кожей с лососем</div>
          <q-space />

        </q-card-section>

        <q-card-section>
          <p class="text-h6">Разработанный нашими ветеринарами и диетологами корм Purina PRO PLAN с комплексом OPTIDERMA обеспечивает улучшенное питание, которое поддерживает чувствительную кожу взрослых собак. Подтверждено, что OPTIDERMA включает в себя специальную комбинацию питательных веществ, которые поддерживают здоровье кожи и красивую шерсть, а отобранные источники белка помогают сократить возможные кожные реакции, связанные с пищевой чувствительностью.<br>
          Специально отобранные источники белка для собак с чувствительной кожей. Сочетание основных питательных веществ, которое помогает поддерживать здоровье суставов вашей собаки при активном образе жизни. Клинически подтверждено: поддерживает здоровье кожи. Содержит высококачественный белок из лосося.</p>
        </q-card-section>
      </q-card>
    </q-dialog>
</div>

 </div>
</template>

<script>

export default {
  name: 'Product',
  data () {
    return {
   more: false,
   products:[{
     id:"0startd1длясобакd2даd3Мелкаяиликарликоваяl1да",
     image:['dogs/1.jpg'],
     textFront:["Pro Plan для взрослых собак мелких пород с чувствительной кожей с лососем"],
     textExpan:["Разработанный нашими ветеринарами и диетологами корм Purina PRO PLAN с комплексом OPTIDERMA обеспечивает улучшенное питание, которое поддерживает чувствительную кожу взрослых собак. Подтверждено, что OPTIDERMA включает в себя специальную комбинацию питательных веществ, которые поддерживают здоровье кожи и красивую шерсть, а отобранные источники белка помогают сократить возможные кожные реакции, связанные с пищевой чувствительностью. Специально отобранные источники белка для собак с чувствительной кожей. Сочетание основных питательных веществ, которое помогает поддерживать здоровье суставов вашей собаки при активном образе жизни. Клинически подтверждено: поддерживает здоровье кожи. Содержит высококачественный белок из лосося."],
   },
   {
     id:"0startd1длясобакd2даd3Мелкаяиликарликоваяd4нетl2да",
     image:['dogs/2.jpg', 'dogs/3.jpg'],
     textFront:["Pro Plan для взрослых собак мелких пород с чувствительным пищеварением с ягненком", "Pro Plan для взрослых собак мелких и карликовых пород с чувствительным пищеварением беззерновой с индейкой"],
     textExpan:[" Разработанный нашими ветеринарами и диетологами корм Purina PRO PLAN® с комплексом OPTIDIGEST® повышает здоровье пищеварительной системы собак, испытывающих дискомфорт в желудочно-кишечном тракте. Клинически доказано: OPTIDIGEST® содержит отобранный источник пребиотиков для улучшения баланса микрофлоры кишечника и качества стула. Корм легко переваривается, благодаря чему подходит для собак с чувствительным пищеварением. Пребиотик активно способствует здоровью кишечника. Клинически подтверждено: улучшает баланс микрофлоры кишечника. Собственная технология приготовления позволяет сохранить полезные свойства куриного мяса. Содержит высококачественный белок из ягненка.", "Корм PRO PLAN® OPTIDIGEST® Grain Free Formula разработан специально для собак мелких и карликовых пород с чувствительным пищеварением. Это беззерновой легкоперевариваемый рацион, который содержит все необходимые ингредиенты для правильного пищеварения. В его основе - комплекс OPTIDIGEST® - особое сочетание питательных веществ, которое помогает поддерживать баланс микрофлоры. Он содержит специальные ингредиенты для поддержания здоровья кишечника и хорошего качества стула. Способствует росту бифидобактерий для улучшения баланса микрофлоры кишечника благодаря содержанию пребиотиков. OPTIDIGEST® GRAIN FREE Formula с высоким содержанием индейки. Чтобы вы смогли подобрать корм, который подходит именно вашему питомцу с чувствительным пищеварением."],
   },
   {
     id:"0startd1длясобакd2даd3Мелкаяиликарликоваяd4нетl3нет",
     image:['dogs/4.jpg'],
     textFront:["Pro Plan для взрослых собак мелких пород с курицей"],
     textExpan:["OPTIBALANCE® способствует поддержанию здоровья сердца. Особое сочетание компонентов для здоровья зубов и десен. Сочетание основных питательных веществ, которое помогает поддерживать здоровье суставов вашей собаки при активном образе жизни. Природный источник волокон улучшает здоровье кишечника. Содержит кусочки высококачественного куриного мяса."],
   },
   {
     id:"0startd1длясобакd2даd3крупнаяl1да",
     image:['dogs/5.jpg'],
     textFront:["Pro Plan для взрослых собак средних и крупных пород с чувствительным пищеварением беззерновой с индейкой"],
     textExpan:["Корм PRO PLAN® OPTIDIGEST® Grain Free Formula разработан специально для собак средних и крупных пород с чувствительным пищеварением. Это беззерновой легкоперевариваемый рацион, который содержит все необходимые ингредиенты для правильного пищеварения. В его основе - комплекс OPTIDIGEST®. br Способствует росту бифидобактерий для улучшения баланса микрофлоры кишечника благодаря содержанию пребиотиков. br OPTIDIGEST® - особое сочетание питательных веществ, которое помогает поддерживать баланс микрофлоры. Он содержит специальные ингредиенты для поддержания здоровья кишечника и хорошего качества стула. Теперь в линейке PRO PLAN® для собак есть беззерновые рационы OPTIDIGEST® GRAIN FREE Formula с высоким содержанием индейки. Чтобы вы смогли подобрать корм, который подходит именно вашему питомцу с чувствительным пищеварением."],
   },{
     id:"0startd1длясобакd2даd3крупнаяd4нетl2да",
      image:['dogs/6.jpg'],
     textFront:["Pro Plan для взрослых собак крупных пород атлетического телосложения с курицей"],
     textExpan:["Сухой корм для взрослых собак PRO PLAN® OPTIBALANCE® создан специально для больших атлетичных животных, учитывает их особые потребности, помогает сохранять их силу и активность. br В состав корма входит комплекс OPTIBALANCE®, который содержит в себе специально отобранные питательные вещества, поддерживающие особые потребности собак и положительно влияющие на здоровье питомцев в долгосрочной перспективе. Собачий корм с курицей PRO PLAN® Large Adult Athletic является полнорационным и содержит большое количество белка в составе."],
   },
   {
     id:"0startd1длясобакd2даd3средняяl1да",
      image:['dogs/7.jpg'],
     textFront:["Pro Plan для взрослых собак средних пород с чувствительной кожей с лососем"],
     textExpan:["Разработанный нашими ветеринарами и диетологами корм Purina PRO PLAN® с комплексом OPTIDERMA® обеспечивает самое современное питание, которое поддерживает чувствительную кожу взрослых собак. Подтверждено, что OPTIDERMA® включает в себя специальную комбинацию питательных веществ, которые поддерживают здоровье кожи и красивую шерсть, а отобранные источники белка помогают сократить возможные кожные реакции, связанные с пищевой чувствительностью. Содержит высококачественный белок из лосося."],
   },
    {
     id:"0startd1длясобакd2даd3средняяl1да",
      image:['dogs/8.jpg'],
     textFront:["Pro Plan для взрослых собак средних пород с чувствительной кожей с лососем"],
     textExpan:["Разработанный нашими ветеринарами и диетологами корм Purina PRO PLAN® с комплексом OPTIDERMA® обеспечивает самое современное питание, которое поддерживает чувствительную кожу взрослых собак. Подтверждено, что OPTIDERMA® включает в себя специальную комбинацию питательных веществ, которые поддерживают здоровье кожи и красивую шерсть, а отобранные источники белка помогают сократить возможные кожные реакции, связанные с пищевой чувствительностью. Содержит высококачественный белок из лосося."],
   },
    {
     id:"0startd1длясобакd2даd3средняяl1да",
      image:['dogs/9.jpg', 'dogs/10.jpg'],
     textFront:["Pro Plan для взрослых собак средних пород с чувствительным пищеварением с ягненком", "Pro Plan для взрослых собак средних и крупных пород с чувствительным пищеварением  беззерновой с индейкой"],
     textExpan:["Разработанный нашими ветеринарами и диетологами корм Purina PRO PLAN® с комплексом OPTIDIGEST® повышает здоровье пищеварительной системы собак, испытывающих дискомфорт в желудочно-кишечном тракте. Клинически доказано: OPTIDIGEST® содержит отобранный источник пребиотиков для улучшения баланса микрофлоры кишечника и качества стула. Содержит высококачественный белок из ягненка.", "Корм PRO PLAN® OPTIDIGEST® Grain Free Formula разработан специально для собак средних и крупных пород с чувствительным пищеварением. Это беззерновой легкоперевариваемый рацион, который содержит все необходимые ингредиенты для правильного пищеварения. В его основе - комплекс OPTIDIGEST®. br Способствует росту бифидобактерий для улучшения баланса микрофлоры кишечника благодаря содержанию пребиотиков. br OPTIDIGEST® - особое сочетание питательных веществ, которое помогает поддерживать баланс микрофлоры. Он содержит специальные ингредиенты для поддержания здоровья кишечника и хорошего качества стула. Теперь в линейке PRO PLAN® для собак есть беззерновые рационы OPTIDIGEST® GRAIN FREE Formula с высоким содержанием индейки. Чтобы вы смогли подобрать корм, который подходит именно вашему питомцу с чувствительным пищеварением."],
   },
    {
     id:"0startd1длясобакd2даd3средняяd4нетl3нет",
      image:['dogs/11.jpg', 'dogs/12.jpg'],
     textFront:["Pro Plan для взрослых активных собак всех пород с курицей", "Pro Plan для взрослых собак средних пород с курицей"],
     textExpan:["Корм Purina PRO PLAN® с комплексом OPTIPOWER® разработан для взрослых собак с особенно высоким уровнем физической активности. OPTIPOWER® сочетает в себе основные питательные вещества, которые повышают выносливость, способствуют быстрому восстановлению мышц и поддержанию здоровья суставов. Это стало возможным благодаря высокому содержанию в формуле белков, жиров и омега 3 жирных кислот. Содержит все питательные вещества, необходимые кормящей собаке для здоровья щенков. Содержит кусочки высококачественного куриного мяса.", "Разработанный нашими ветеринарами и диетологами корм Purina PRO PLAN® с комплексом OPTIHEALTH® предоставляет современное питание, которое оказывает долгосрочное влияние на здоровье собак. Комплекс OPTIHEALTH® сочетает специально отобранные питательные вещества необходимые собакам разных размеров и телосложения, который поддерживает их особые потребности и помогает сохранить им отличное состояние. Особое сочетание компонентов для здоровья зубов и десен. Сочетание основных питательных веществ, которое помогает поддерживать здоровье суставов вашей собаки при активном образе жизни. Помогает собаке сохранять блестящую шерсть. Содержит кусочки высококачественного куриного мяса."]},
     {
       id:"0startd1длясобакd2нетd3Мелкаяиликарликоваяl1да",
       image:['dogs/17.jpg'],
     textFront:["Pro Plan для щенков мелких пород с чувствительной кожей с лососем"],
     textExpan:["Разработанный нашими ветеринарами и диетологами корм Purina PRO PLAN® с комплексом OPTIDERMA® обеспечивает улучшенное питание, которое поддерживает чувствительную кожу щенков. Подтверждено, что комплекс OPTIDERMA® включает в себя специальную комбинацию питательных веществ, которые поддерживают здоровье кожи и красивую шерсть, а отобранные источники белка помогают сократить возможные кожные реакции, связанные с пищевой чувствительностью. Содержит высококачественный белок из лосося."],
     },
      {
       id:"0startd1длясобакd5нетd6Мелкаяиликарликоваяl10нет",
       image:['dogs/18.jpg'],
     textFront:["Pro Plan для щенков мелких пород с курицей"],
     textExpan:["Чтобы помочь укрепить естественную защиту щенков в начале жизни, ветеринары и диетологи Purina разработали корм Purina PRO PLAN® PUPPY с комплексом OPTISTART®. Особый ингредиент молозиво — первичное молоко матери, входящий в комплекс OPTISTART®, богатый природными антителами, помогает укрепить естественную защиту щенков для борьбы с ежедневными проблемами. br Помогает развивающейся иммунной системе щенка действовать эффективно. Особое сочетание компонентов для здоровья зубов и десен. Сочетание основных питательных веществ, которое помогает поддерживать здоровье суставов вашего щенка при активном образе жизни. В состав корма входит специальный компонент для укрепления иммунитета и здоровья на долгие годы. Подобранная энергетическая ценность корма для щенков с повышенным метаболизмом. Содержит кусочки высококачественного куриного мяса."],
     },
      {
       id:"0startd1длясобакd5нетl8крупная",
       image:['dogs/13.jpg'],
     textFront:["Pro Plan для щенков крупных пород атлетического телосложения с курицей"],
     textExpan:["Чтобы помочь укрепить естественную защиту щенков в начале жизни, ветеринары и диетологи Purina разработали корм Purina PRO PLAN® PUPPY с комплексом OPTISTART®. Особый ингредиент молозиво — первичное молоко матери, входящий в комплекс OPTISTART®, богатый природными антителами, помогает укрепить естественную защиту щенков для борьбы с ежедневными проблемами. br Помогает развивающейся иммунной системе щенка действовать эффективно. Особое сочетание компонентов для здоровья зубов и десен. Сочетание основных питательных веществ, которое помогает поддерживать здоровье суставов вашего щенка при активном образе жизни. В состав корма входит специальный компонент для укрепления иммунитета и здоровья на долгие годы. Подобранная энергетическая ценность корма для щенков с повышенным метаболизмом. Содержит кусочки высококачественного куриного мяса."],
     },
        {
       id:"0startd1длясобакd5нетd3средняяl1да",
       image:['dogs/14.jpg'],
     textFront:["Pro Plan для щенков средних пород с чувствительной кожей с лососем"],
     textExpan:["Разработанный нашими ветеринарами и диетологами корм Purina PRO PLAN® с комплексом OPTIDERMA® обеспечивает улучшенное питание, которое поддерживает чувствительную кожу щенков. Подтверждено, что комплекс OPTIDERMA® включает в себя специальную комбинацию питательных веществ, которые поддерживают здоровье кожи и красивую шерсть, а отобранные источники белка помогают сократить возможные кожные реакции, связанные с пищевой чувствительностью. Содержит высококачественный белок из лосося."],
     },
       {
       id:"0startd1длясобакd5нетd3средняяd4нетl2да",
       image:['dogs/16.jpg'],
     textFront:["Pro Plan для щенков средних пород с чувствительным пищеварением с ягненком"],
     textExpan:["Разработанный нашими ветеринарами и диетологами корм Purina PRO PLAN® с комплексом OPTIDIGEST® повышает здоровье пищеварительной системы щенков, испытывающих дискомфорт в желудочно-кишечном тракте. Клинически доказано: OPTIDIGEST® содержит отобранный источник пребиотиков для улучшения баланса микрофлоры кишечника и качества стула. В состав корма входит специальный компонент для укрепления иммунитета и здоровья на долгие годы."],
     },
      {
       id:"0startd1длясобакd5нетd3средняяd4нетl2нет",
       image:['dogs/15.jpg'],
     textFront:["Pro Plan для щенков средних пород с курицей"],
     textExpan:["Чтобы помочь укрепить естественную защиту щенков в начале жизни, ветеринары и диетологи Purina разработали корм Purina PRO PLAN® PUPPY с комплексом OPTISTART®. Особый ингредиент молозиво — первичное молоко матери, входящий в комплекс OPTISTART®, богатый природными антителами, помогает укрепить естественную защиту щенков для борьбы с ежедневными проблемами. br Помогает развивающейся иммунной системе щенка действовать эффективно. Особое сочетание компонентов для здоровья зубов и десен. Сочетание основных питательных веществ, которое помогает поддерживать здоровье суставов вашего щенка при активном образе жизни. В состав корма входит специальный компонент для укрепления иммунитета и здоровья на долгие годы. Подобранная энергетическая ценность корма для щенков с повышенным метаболизмом. Содержит кусочки высококачественного куриного мяса."],
     },

   ]
    }
  },
  methods:{

  }
}
</script>

<style>

.Product{
  background: #000;
  position: relative;
  height: 100vh;
}

.Product__logo{
  width: 20%;
  position: absolute;
  left: 0;
  right: 0;
  top: 0;
  bottom: 0;
  margin: auto;
  border: 1px solid black;
  outline: 1px solid #fff;
  cursor: pointer;
  position: absolute;
  top: 3vh;
  bottom: unset;
  border:none;
  box-shadow: 0px 6px 6px -5px #fff;
  width: 13.7%;
}
.Product__wrapper
{
    width: 402px;
    margin: auto;
    margin-top: 33vh;
    border: 2px solid #fff;
    border-radius: 8px;
}
span.q-btn__content
{
      font-size: 1.5rem;
}



</style>
